# 1. Сначала скачиваем "фундамент" — готовый образ с Python
FROM python:3.12.1-slim

# 2. Создаем внутри Докера папку /app, где будет жить наш сайт
WORKDIR /app

# 3. Копируем файл со списком библиотек внутрь Докера
COPY requirements.txt .

# 4. Командуем Докеру установить эти библиотеки
RUN pip install --no-cache-dir -r requirements.txt

# 5. Теперь копируем ВЕСЬ твой код из текущей папки в Докер
COPY . .

# 6. Говорим, что сайт работает на порту 8000
EXPOSE 8000

# 7. Финальная команда: запустить сервер Django
# 0.0.0.0 — это значит "слушать все входящие запросы"
CMD ["gunicorn", "--bind", "0.0.0.0:8000", "abiturient_project.wsgi:application"]